Revit 2027 API
BuiltInFailures.KeyBasedTreeEntryFailures.DuplicateEntry Property
 Duplicate code '[Code]', description: '[Description]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateEntry { get; }
Public Shared ReadOnly Property DuplicateEntry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateEntry {
	FailureDefinitionId^ get ();
}
static member DuplicateEntry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace